app/views/boards/_form.html.erb

    <span>タグ</span>
    <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>
---
SELECT `tags`.* FROM `tags`