app/views/boards/show.html.erb

  <div class="p-comment_listTitle">コメント</div>
  <% @board.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`board_id` = 1