app/controllers/boards_controller.rb

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
SELECT  `boards`.* FROM `boards` INNER JOIN `board_tag_relations` ON `boards`.`id` = `board_tag_relations`.`board_id` WHERE `board_tag_relations`.`tag_id` = 1 LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`
SELECT `tags`.* FROM `tags`
---
  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page])

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('ひょうどう', 'まこと', 'フランス負けろ', '2022-12-01 07:03:55', '2022-12-01 07:03:55')
---
  def create
    board = Board.new(board_params)

    if board.save

UPDATE `boards` SET `body` = 'ブラジル負けろ', `updated_at` = '2022-12-01 09:11:08' WHERE `boards`.`id` = 9
---
  def update
    @board.update(board_params)

DELETE FROM `boards` WHERE `boards`.`id` = 8
---
  def destroy
    @board.destroy

SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 10 LIMIT 1
---
  def set_target_board
    @board = Board.find(params[:id])