app/controllers/comments_controller.rb

INSERT INTO `comments` (`board_id`, `name`, `comment`, `created_at`, `updated_at`) VALUES (1, 'かりふらわ', 'ぺぺぺ', '2022-12-08 09:49:44', '2022-12-08 09:49:44')
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 5
---
  def destroy
    comment = Comment.find(params[:id])
    comment.delete